web_app/app/views/welcome/index.html.erb

    <li><%= user.first_name %></li>
    <% if user.referreds.count > 0 %>
---
SELECT COUNT(*) FROM "referreds" WHERE "referreds"."user_id" = $1  [["user_id", 1]]